src/InformationRegisters/Telegram_Настройки/Telegram_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Telegram_Настройки</name>
  <resources>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Bot</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Api</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/Telegram_Сервер/Module.bsl
//
//
Функция ПолучитьНастройкиTelegram()
	
	СтруктураНастроек = Новый Структура();
	
	СтруктураНастроек.Вставить("Bot", "");
	СтруктураНастроек.Вставить("Token", "");
	СтруктураНастроек.Вставить("Api", "");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Telegram_Настройки.Bot КАК Bot,
	                      |	Telegram_Настройки.Api КАК Api,
	                      |	Telegram_Настройки.Token КАК Token
	                      |ИЗ
	                      |	РегистрСведений.Telegram_Настройки КАК Telegram_Настройки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
		
	КонецЕсли;
	
	Возврат Выборка;
	
КонецФункции
